<!--#include file="Top.asp" -->
<table width="770" border="0" align="center" cellpadding="0" cellspacing="3" bgcolor="#FFFFFF">
  <tr> 
    <td height="25"><div align="center"><a href="mj.asp">慈溪麻将</a> <a href="cjmaijiang.asp">冲击麻将</a> 
        <a href="suoha.asp">梭哈游戏 </a><a href="sg.asp">四国大战 </a><font color="#000000"><a href="ddz.asp">斗地主 
        </a></font><a href="wzq.asp">五子棋</a> <a href="uq.asp">围棋 </a><a href="xq.asp">中国象棋 
        </a><a href="newsuoha.asp">新梭哈 </a><a href="cxddz.asp">慈溪斗地主</a> <a href="tlj.asp">拖拉机 
        </a><a href="gongzhu.asp">拱猪 </a><font color="#000000"><a href="zjh.asp">炸金花</a></font> 
        <a href="gjxq.asp">国际象棋</a></div></td>
  </tr>
  <tr> 
    <td height="25"><font color="#000000">&nbsp;&nbsp;● 梭哈游戏规则</font></td>
  </tr>
  <tr> 
    <td>★规则及打法 <br>
      　　<font color="#000000">梭哈游戏</font>用的是扑克牌，我们各门花色的牌只取「8、9、10、J、Q、K、A」，有黑桃、红桃、草花、方片四种，因此游戏中共有28张牌。 
      <br>
      　　 游戏开始后，先发给各家2张牌，从第二张牌开始自动亮出，明牌大家都可以看到。从亮牌之后开始，每发一张牌，以牌面较大者为优先，进行下注。有人下注后，其它想继续玩下去的人，要按「跟注」键，或可选择加注,(新版本梭哈可以在最限制内多次加注，第三张牌时加里加至梭哈时的注数）然后再按{跟注}键跟注,若不想跟牌，请按「放弃」键，先前跟过的筹码，亦无法取回。 
      <br>
      　　 每次发牌后的情况相同，但最后3张牌发齐的时候允许&quot;梭了&quot;即压上全部筹码，但这里全部筹码的大小是指此房间设定的最小输赢筹码数去除已经压上的筹码数。 
      <br>
      　　 最后的胜利者获得本局桌面上的全部筹码。 <br>
      　　 请大家注意：如果用户的筹码少于10将不能再玩五张牌游戏，必须说明的是：严禁利用游戏五张牌赌博，一旦发现，一切责任玩家自己负责。 <br> 
      <br>
      ★比较大小： <br>
      　　 牌型比较：同花顺＞四条＞葫芦＞同花＞顺子＞三条＞两对＞对子＞散牌。 <br>
      　　 数字比较：Ａ＞Ｋ＞Ｑ＞Ｊ＞１０＞９＞８ <br>
      　　 花式比较：黑桃＞红桃＞草花＞方片 牌型说明： <br>
      　　 同花顺为同一种花色的顺子，比如全部是黑桃的A,K,Q,J,10。但8和A之间不算顺子。 <br>
      　　 四条为四张同样大小的牌，比如４个A。 <br>
      　　 葫芦为三张一样的带２张一样的，比如３个A带２个８。大家都是３带２时，比较三个头的大小。 <br>
      　　 同花为五张牌为一种花式，如果大家都是同花，比最大的一张牌，如果大小还一样就比这张牌的花式。 <br>
      　　 顺子为５张牌是顺子但不同花，如果大家都是顺子，比最大的一张牌，如果大小还一样就比这张牌的花式。请注意，8910JA不算顺子 <br>
      　　 三条是指有三个头，如果大家都是三条，比三条的大小。两对是指有两个对子，如果大家都是两对，比大对子的大小，如果大对子也一样，比小对子的大小，如果还是一样，比大对子中的最大花式。对子是指有一个对子，如果大家都是对子，比对子的大小，如果对子也一样，比这个对子中的最大花色。 
      <br>
      　　 散牌是没有上面说的任何情况，比最大一张牌的大小，如果大小一样，比这张牌的花色。</td>
  </tr>
  <tr> 
    <td>&nbsp;</td>
  </tr>
</table>
<div align="center">
<!--#include file="Copy.asp" -->
</div>
</body>
</html>
