<!--#include file="top.asp" -->
<table width="770" border="0" align="center" cellpadding="0" cellspacing="0">
  <tr> 
    <td bgcolor="F7F7F7">
<table width="678" border="0" align="center" cellpadding="0" cellspacing="0" class="size">
        <tr> 
          <td width="678" height="69" background="images/yxgz_08.gif"> <div align="center"> 
              <table width="94%" height="41" border="0" cellpadding="0" cellspacing="0">
                <tr> 
                  <td height="41" valign="bottom" background="default1_08.jpg" class="ZI">● 两副斗地主游戏规则</td>
                  <td>&nbsp;</td>
                </tr>
              </table>
          </div></td>
        </tr>
        <tr> 
          <td background="images/yxgz_10.gif">
		    <p>两副斗地主</p>
		    <p>一：游戏介绍：</p>
		    <p>游戏使用两副牌，四个玩家同时游戏，一队为地主，另外三个人为另一队，先出完牌的一队获胜。 </p>
		    <p>&nbsp;</p>
		    <p>二：规则介绍：</p>
		    <p>1、相关术请</p>
		    <p>发牌：游戏开始后发牌，留8张底牌，每人发25张牌。</p>
		    <p>叫分：随机选择一个玩家开始依次叫分，玩家可以选择叫“1分”、“2分”、“3分”或者不叫分，所叫的分数必须比上一家高。</p>
		    <p>叫3分的玩家成为地主。</p>
		    <p>如果没有玩家叫3分，则一轮下来叫分最高的玩家成为地主。</p>
		    <p>如果没有任何一个玩家叫分，则重新发牌，三轮都没有人叫地主，则解散游戏。</p>
		    <p>底牌：决定地主后，底牌发给成为地主的玩家，其他玩家可见。</p>
		    <p>2、 牌型</p>
		    <p>单张：任意一张单牌。</p>
		    <p>顺子：任意五张或者五张以上点数相连的牌，2和王不能出现在顺子中。</p>
		    <p>对子：任意两张点数相同的牌，两个小王或两个大王也算对子牌型。</p>
		    <p>连对：三对或三对以上点数相连的牌，如：556677。2和王不能出现在连对中。</p>
		    <p>三张：任意三张点数相同的牌。</p>
		    <p>三顺：两组或两组以上点数相连的三张牌，如：555666；555666777888。2和王不能出现在三顺中。</p>
		    <p>三带二：点数相同的三张牌＋一对牌，如55577</p>
		    <p>飞机带翅膀：三顺＋数量相同的对牌，如555666777＋99JJKK</p>
		    <p>炸弹：四张或四张以上点数相同的牌，如：66666，999999</p>
		    <p>天王炸弹：四张王牌</p>
		    <p>3、牌型的比较</p>
		    <p>天王炸弹大于所有其他的牌型。</p>
		    <p>炸弹牌型大于除天王炸弹外的所有其他牌型。炸弹的牌型相互比较时，牌张数多的大，牌数相同的情况，则比较点数，点数大的炸弹大。</p>
		    <p>非炸弹的牌型，牌型、张数相同才能相互比较，点数大的则大。三带二、飞机带翅膀的牌型比较牌型中张数最多的牌的点数即可。</p>
		    <p>点数大小，从大到小依次为：大王、小王、2、A、K、Q、J、10、9、8、7、6、5、4、3。</p>
		    <p>4、胜负条件</p>
		    <p>地主为一队，其他三个玩家为另一队，先出完牌的玩家所属的队伍获胜。</p>
		    <p>三：积分计算：</p>
		    <p>底分：叫牌的分数，可以叫1分、2分、3分。</p>
		    <p>倍数：初始为1倍。</p>
		    <p>一局结束后，基本分的计算方法：</p>
		    <p>地主胜：地主得分为3×底分×倍数；其余玩家各得：－底分×倍数</p>
		    <p>地主败：地主得分为 －3×底分×倍数；其余玩家各得：底分×倍数</p>
		    <p>以下情况，输赢的基本分翻倍（翻倍条件可重叠）：</p>
		    <p>每打出一个六张牌和七张牌的炸弹，基本分×2</p>
		    <p>每打出一个8张牌炸弹和天王炸弹，基本分×3</p>
		    <p>地主所有牌出完，其他三家一张都未出，基本分×2 </p>
		    <p>其他两家中有一家先出完牌，地主只出过一手牌，基本分×2</p>
		    <p>&nbsp;</p>
		    <p>四：积分等级：</p>
		    <p><br />
            </p>
		    <p><img src="images/lfddz.gif" width="607" height="253"></p>
		  <p><br>
          </p></td>
        </tr>
      </table>
      
    <table width="678" height="35" border="0" align="center" cellpadding="0" cellspacing="0">
      <tr>
        <td background="images/yxgz_12.gif">&nbsp;</td>
      </tr>
    </table>
    <p>&nbsp;</p></td>
  </tr>
</table>
<!--#include file="copy.asp" -->