<!--#include file="top.asp" -->
<table width="770" border="0" align="center" cellpadding="0" cellspacing="0">
  <tr> 
    <td bgcolor="F7F7F7">
<table width="678" border="0" align="center" cellpadding="0" cellspacing="0" class="size">
        <tr> 
          <td width="678" height="69" background="images/yxgz_08.gif"> <div align="center"> 
              <table width="94%" height="41" border="0" cellpadding="0" cellspacing="0">
                <tr> 
                  <td height="41" valign="bottom" background="default1_08.jpg" class="ZI">● 飞行棋游戏规则</td>
                  <td>&nbsp;</td>
                </tr>
              </table>
          </div></td>
        </tr>
        <tr> 
          <td background="images/yxgz_10.gif">
		    <p><strong>飞行棋</strong></p>
		    <p>一、游戏介绍：</p>
		    <p>将流行的飞行棋游戏加以改进，加入在线对战元素，支持2~4个玩家对战，玩家通过对家配合或混战，在游戏中一决高下。针对飞行棋游戏中最激动人心的撞子的特点，扩大了撞子在游戏中的所占的份量，并且参考现实战争设计道具和增加新的游戏地图，使游戏更加刺激好玩。<br /></p>
		    <p>二、基本规则：</p>
		    <p>起飞：只有在掷得6点后，方可将一枚棋子由“基地”起飞至起飞点，并可以再掷骰子一次，确定棋子的前进步数；在改进规则场中，只要掷得5点以上的点数就可以起飞。</p>
		    <p>连投奖励：在游戏进行过程中，掷得6点的游戏者可以连续投掷骰子，直至显示点数不是6点或游戏结束。</p>
		    <p>迭子：己方的棋子走至同一格内，可迭在一起，这类情况称为“迭子”。敌方的棋子不能在迭子上面飞过；当敌方的棋子正好停留在“迭子”上方时，敌方棋子与2架迭子棋子同时返回停机坪。若其它游戏者所掷点数大于他的棋子与迭子的相差步数，则多余格数为由迭子处返回的格数；但当其它游戏者所掷点数是6而且大于他得棋子与迭子的相差步数时，那么其它游戏者的棋子可以停于迭子上面，但是当该游戏者依照规则自动再掷点的时候，服务器自动走刚才停于迭子上面的棋子。</p>
		    <p>如果棋子在准备通过虚线时有其他棋子停留在虚线和通往终点线路的交叉点时：A、如果对方是一个棋子，则将该棋子逐回基地，本方棋子继续行进到对岸；B、如果对方是两个棋子重叠则该棋子不能穿越虚线、必须绕行。<br /></p>
		    <p>撞子：棋子在行进过程中走至一格时，若已有敌方棋子停留，可将敌方的棋子逐回基地。</p>
		    <p>跳子：棋子在地图行走时，如果停留在和自己颜色相同格子，可以向前一个相同颜色格子作跳跃。</p>
		    <p>飞棋：棋子若行进到颜色相同而有虚线连接的一格，可照虚线箭头指示的路线，通过虚线到前方颜色相同的的一格后，再跳至下一个与棋子颜色相同的格内；若棋子是由上一个颜色相同的格子跳至颜色相同而有虚线连接的一格内，则棋子照虚线箭头指示的路线，通过虚线到前方颜色相同的的一格后，棋子就不再移动。<br /></p>
		    <p>三：胜负判断：</p>
		    <p>混战模式时某一方的四个棋子领先其他方都到达终点则游戏结束，先将所有棋子走到终点的一方获胜。</p>
		    <p>配合模式时某一方两玩家的八个棋子领先另一方都到达终点则游戏结束，先将所有棋子走到终点的一方获胜。<br /></p>
		    <p>四：积分等积：<br /></p>
		    <p><img src="images/fxq.gif" width="614" height="230"></p>
		    <p><br>
          </p></td>
        </tr>
      </table>
      
    <table width="678" height="35" border="0" align="center" cellpadding="0" cellspacing="0">
      <tr>
        <td background="images/yxgz_12.gif">&nbsp;</td>
      </tr>
    </table>
    <p>&nbsp;</p></td>
  </tr>
</table>
<!--#include file="copy.asp" -->