<!--#include file="top.asp" -->
<table width="770" border="0" align="center" cellpadding="0" cellspacing="0">
  <tr> 
    <td bgcolor="F7F7F7">
<table width="678" border="0" align="center" cellpadding="0" cellspacing="0" class="size">
        <tr> 
          <td width="678" height="69"> <div align="center"> 
              <table width="94%" height="41" border="0" cellpadding="0" cellspacing="0">
                <tr> 
                  <td height="41" valign="bottom" class="ZI">● 双扣游戏规则</td>
                  <td>&nbsp;</td>
                </tr>
              </table>
            </div></td>
        </tr>
        <tr> 
          <td> 游戏规则： 
            <p>发牌：<br>
              当四方全部开始后，服务器直接发牌。 <br>
              第一个出牌的权力：每一盘随机抽出一张牌，谁抓到此牌，谁有第一个出牌的权力，抓到另外一张同样的牌，将上他的对家，要换位置。两张在一家的话就不用换位置。 
              <br>
              出牌过程：游戏者依次轮流出牌，后一家打出的牌必须比前一家打出的牌大，如没有可以弃权(Pass)； 如果其他游戏者都Pass，则最后出牌的一方可以出新的牌型；直到某个游戏者手中牌全部出完。<br>
              牌的大小 本游戏的牌点由大到小排列为：大王、小王、2、A、K、Q、J、10、9、8、7、6、5、4、3； <br>
              牌形的大小：单张、对、三同张、连对（必须在３连队以上可以出）、连三同张（必须在３连三同张以上）、顺子（２不能出现在顺子中）牌型，直接根据牌点确定大小，但要求出牌的数量必须相同； 
              不支持三连二牌型； <br>
              炸弹，如果牌张数相同，则按牌点数确定大小，否则牌张数越多越大； 炸弹大于任何其它非炸弹的牌型，天王炸弹最大。<br>
              牌型： <br>
              单张：可以是手中的任意一张牌； <br>
              对：两张牌点相同的牌，两张牌的花色可以不同； <br>
              连对：三对或三对以上相连的牌，如：33 44 55，JJ QQ KK AA。注意：2 不可以在连队中。 <br>
              三同张：三张牌点相同的牌，三张牌的花色可以不同； 连三同张，三个或三个以上相连的三同张牌， 注意：2不可以在连三同张中；三连二：不能出。 
              <br>
              顺子：五张或五张以上牌点连续的牌，花色不限。例如：3、4、5、6、7、8、9、10、J、Q、K等。注意：2不能出现在顺子中。 <br>
              同花顺：和一般的顺子没有区别。 <br>
              炸弹：四张或四张以上牌点相同的牌，如：4444，77777，JJJJJJJ； <br>
              天王炸弹：四张王牌，构成天王炸弹，这时游戏中最大的牌型。 　　接风：双扣的特色，当某个人最后一手牌出了后，一圈内如果没有人要。则下一手的出牌权力是他的同伴。 
              <br>
            </p></td>
        </tr>
      </table>
      
    <p>&nbsp;</p></td>
  </tr>
</table>
<!--#include file="../copy.asp" -->