<!--#include file="top.asp" -->
<table width="770" border="0" align="center" cellpadding="0" cellspacing="0">
  <tr> 
    <td bgcolor="F7F7F7">
<table width="678" border="0" align="center" cellpadding="0" cellspacing="0" class="size">
        <tr> 
          <td width="678" height="69"> <div align="center"> 
              <table width="94%" height="41" border="0" cellpadding="0" cellspacing="0">
                <tr> 
                  <td height="41" valign="bottom" class="ZI">● 福州麻将游戏规则</td>
                  <td>&nbsp;</td>
                </tr>
              </table>
            </div></td>
        </tr>
        <tr> 
          <td> 术语：<br>
            码牌：系统自动在每人面前码18墩牌组成四道牌墙。 <br>
            定庄：系统随机选定一玩家做庄。连续游戏（1圈或几圈）：庄家和牌或流局，下一局可以连庄，否则由庄家的下家做庄。 <br>
            拿牌：庄家扔两个骰子，骰子的点数决定谁先拿牌，先拿牌的人再从自己面前的牌堆右向左按根据两个骰子点数之和的点数开始拿牌。即在那人面前的牌墙里，按顺时针方向余下与点数之和相同的墩数再开始拿牌。 
            <br>
            如下图，东为庄家，假设庄家扔出的骰子点数为11，从西家面前的牌墙拿牌。先按绿色箭头的方向（即顺时针）数11墩，从第12墩开始拿牌。 
            <br>
            庄家拿17张牌，闲家16张牌。 <br>
            坎门：等4家都拿完牌后，庄家要多拿一张牌，就是接下来的那张。 <br>
            补花：凡是拿牌拿到“东、南、西、北、中、发、白板、梅、兰、竹、菊、春、夏、秋、冬”的，自庄家开始在相反的一边（即牌尾）补花，一次补完手里的花；如果补花牌过程中仍抓进花牌，须等本轮四家都补过花牌后再行补牌，再次补花牌的顺序仍然以庄家为首开始，直到手上的牌均是“索、万、饼”为止。同样，在游戏的过程中如果抓到花牌，也一样是在这边补花。 
            <br>
            开金：“金”即是其他麻将中的“财神”，我们称之为“金”，可以替代任何一张牌。当大家补完花后就可以开“金”了，补完花后从牌尾翻开的第一张就是“金”。如果开金时开出的为花，则算庄家的，庄家重新从牌尾翻开一张牌为金。 
            <br>
            打牌过程：<br>
            游戏在一开始，庄家从牌中选出一张最没用的牌丢出。此时，其它三家都有权力要那张丢出的牌。庄家的下家（右手边的玩者），有权力吃或碰那张牌，其它两家则只可碰或杠那张牌。“碰”比“吃”优先。 
            <br>
            出牌：<br>
            凡是抓进、吃、碰、开杠、补花后，不和牌便要打出一张牌。　　 <br>
            金牌打出后，本圈内打金牌的人只能自摸，不能平胡；其他玩家本圈内可以平胡。本系统设置为金牌不允许打出 <br>
            吃牌：<br>
            上家打出牌，与他的下家手中的牌可以组成一副顺子，下家的界面上会弹出“吃”牌的按钮和组合的牌型供选择。鼠标移到吃牌组合上，手牌里相应的牌就高亮显示，其他牌变灰。 
            <br>
            碰牌：<br>
            A打出的牌与B手中的对子相同，B可以碰牌。会弹出“碰”牌的按钮和组合的牌型供选择。“碰牌”比“吃牌”优先。鼠标移到碰牌组合上，手牌里相应的牌就高亮显示，其他牌变灰。<br>
            碰牌和花牌一样要放在手牌的前面。 <br>
            开杠：<br>
            报开杠后应即在牌尾处补进一张牌。吃碰牌时，手中有杠牌，不能开杠。只能在下一次抓进牌后才能开杠，杠分以下两种。 <br>
            明杠：A打出一张与B的暗刻相同的牌，B即报杠。或者B抓进一张与已经碰的刻子牌相同。 <br>
            暗杠：玩家自己抓到4张相同的牌。<br>
            杠牌时将会弹出“杠牌”按钮和组合的牌型供玩家选择。鼠标移到碰牌组合上，手牌里相应的牌就高亮显示，其他牌变灰。 <br>
            和局：<br>
            一般情况下最后留18张，但每当有人有一个明杠则多留1张，有一个暗杠则多留2张（4个一样的花也算暗杠多留两张）。<br>
            最后可抓的4张牌（即除去剩张可抓的牌）为最后一出牌，最后一出牌不再补花和出牌，若抓的牌就和的人由服务器自动和掉，按自摸计算。如果4人均没自摸，即为和局。<br>
            和局要留的牌是在打牌过程中不停变化，直到最后才留够十八张牌。 <br>
            本系统中，在和局前的8张牌时，开始提示和局时要留的牌.和局游戏结束时，每个人手中最后的一张牌就是他最后抓的那张牌.<br>
            和牌的基本牌型：<br>
            （注：1=单张　11=将、对子　111=刻子　1111=杠　123=顺子） <br>
            基本牌型 <br>
            11、123、123、123、123、123<br>
            11、123、123、123、123、111（1111，下同） <br>
            11、123、123、123、111、111<br>
            11、123、123、111、111、111<br>
            11、123、111、111、111、111<br>
            11、111、111、111、111、111<br>
            和牌的特殊牌型：<br>
            天和：庄家取完牌后，不用打出，已经和牌，称为天和。天和和抢金的计番相同。 <br>
            抢金：出现在开局开完金后，有两种情况：<br>
            a、庄家开局时出首张牌时打出一张没用的牌，将开出来的“金”换进，即可和牌的；<br>
            b、闲家在庄家出过首张牌后将“金”抓进，即可和牌的。<br>
            抢金是以每盘每个玩家的首张牌有效。<br>
            在一把牌中，如果庄家和闲家同时都是可以抢金的牌，由于闲家没打出，所以算闲家抢金。但是，如果庄家是天和，就算闲家抢金，也是庄家天和在先。<br>
            抢金的番按牌局底番的30倍计，花牌的番数按自摸计。 <br>
            平和：<br>
            如果赢家和牌的时候，一朵花牌都没有抓到、也没有开杠的话，即为平和。<br>
            平和的番按抢金计算。 <br>
            三金倒：<br>
            在牌局结束前，任何一家，只要抓到三张“金”，就可和牌，不用根据基本牌型，此称为“三金倒”。<br>
            三金倒的番按牌局底番的40倍计，花牌的番数按自摸计。 <br>
            金雀：<br>
            用两只金来做对子，即是金雀。<br>
            金雀的番按牌局底番的60倍计，花牌的番数按自摸计。<br>
            在一人以上听同一张牌时，不论位置先后，金雀优先和。<br>
            金雀胡时，自摸是算两倍（花加金）的个数×2。<br>
            胡就（花加金）×1<br>
            和牌番数计算中罗列的番值是赢每个闲家的番数。<br>
            福州麻将的番数计算是由底番、花番和金组成。 <br>
            底番：根据联众大厅房间的设置不同底番不同，目前设置底番为1。 <br>
            花番：每朵花的番数与底番相同。花番的计算以本局和牌的玩家才计。 <br>
            金：每张金的番数与花相同。 <br>
            其中：<br>
            和牌的玩家所开的杠，一个明杠算一朵花，一个暗杠算两朵花。<br>
            花牌中，每抓一朵花就计1个花番；抓齐４个一样的花（如４个“东”或者“春夏秋冬”一套），按６朵花计。如４个“东”＝６朵花。<br>
            金按照花番计算，有几个金和牌时便多算几张花的番数。<br>
            庄家若超过一连庄，其他三家应多输连庄的点数。同样若被顶庄庄家也要付赢牌者相应的连庄点数。超过一连庄是为：庄家第二庄的时候算一连庄；连庄的点数是1连庄，点数＝1底番。 
            <br>
            抢炮和: 听金雀或金龙的玩家可以抢其他普通点炮和的玩家和牌，如果没有金龙或金雀，则按逆时针顺序，排在最前面的玩家先和牌.<br>
            具体算法<br>
            和牌通用公式为：<br>
            点炮和＝花+金+特殊和牌牌型倍数+连庄数+5<br>
            自摸和＝（连庄数+花+金+5）×2+特殊和牌倍数<br>
            注意：点炮、自摸和时如果遇到几种特殊和法同时出现，则只计番数最高的特殊和法，其他不计。<br>
            其中特殊和牌方式主要为以下几种：<br>
            三金倒＝（花+金+连庄数+5）×2+40<br>
            抢金＝（花+金+连庄数+5）×2+30<br>
            金雀＝（花+金+连庄数+5）×2+60<br>
            平和（无花、无杠）＝（金+连庄数+5）×2+30<br>
            平和（只有1张花）＝（花+金+连庄数+5）×2+15
            <p>注意：特殊牌型和牌时（非点炮和、自摸和的普通和牌），如：三金倒、抢金、天和时又有其他特殊牌型，有2种或2种以上特殊和法同时出现时，番数将累加。(三金倒和抢金，金雀，金龙不可以同时出现)<br>
              闲金时不能点炮和，但听金雀和金龙时可以点炮和。 <br>
              闲金是指当时手中的牌型可以和任何一张牌.<br>
              特殊和牌的积番计算：<br>
              A、抢金<br>
              抢金的底番按牌局底番的30倍计，花牌的番数按自摸计。<br>
              B、平和<br>
              打36花的牌，平和与抢金计番相同。<br>
              C、三金倒<br>
              三金倒的底番按牌局底番的40倍计，花牌的番数按自摸计。<br>
              D、金雀<br>
              金雀底的底番按牌局底番的60倍计，花牌的番数按自摸计。<br>
              金雀胡时，金雀点炮和、金雀自摸番数计算如下：<br>
              金雀自摸番数＝（花+金+连庄数+5）×2+60<br>
              金雀点炮和番数＝花+金+连庄数+5+60<br>
              E、只有一张花的情况下，算平和。番数计算为：（花+金+连庄数+5）×2+15<br>
              F、金龙：<br>
              和牌时如果手里有3张金牌，并且3张金牌只能当作自己本身的刻子来使用，即是金龙。<br>
              金龙和时，点炮、自摸和番数计算如下：<br>
              金雀点炮和番数＝花+金+连庄数+5+120<br>
              金雀自摸番数＝（花+金+连庄数+5）×2+120<br>
              连庄与抓庄：<br>
              A、庄家在连庄的时候，要根据连庄的次数加底番。而抓庄的玩家，在和牌的时候要多赢庄家连庄的次数。<br>
              庄家连续坐庄而被闲家顶下，庄家应多付赢牌的闲家连庄的底番，如：现在底番为一番，连庄3次，即闲家和牌后的番数+庄家连庄的3番。<br>
              B、玩家第一次做庄后连的第一庄为站顶，不算连庄的底数，从第二次连庄起算第一次的连庄底番。<br>
              例如：现在底番为1番，连庄1次时，底番为1+1＝2；连庄2次时，底番为1+2＝3，依次类推。 <br>
              普通和 花+金+连庄数+5+特殊和牌牌型倍数 <br>
              自摸 （连庄数+花+金+5）×2+特殊和牌倍数 <br>
              只有一张花 （花+金+连庄数+5）×2+15<br>
              抢金 （花+金+连庄数+5）×2+30<br>
              天和按抢金计番 <br>
              平和 （金+连庄数+5）×2+30<br>
              如遇无花、无杠的情况下和牌则按抢金算番 <br>
              三金倒 <br>
              （花+金+连庄数+5）×2+40<br>
              金雀 （花+金+连庄数+5）×2+60<br>
              金龙 （花+金+连庄数+5）×2+120<br>
              金番 1个金牌算1个花番 <br>
              一套花 6个花番 <br>
              4个一样的花如：4个东或“春夏秋冬”等 <br>
              明杠 1个花番 <br>
              暗杠 2个花番 <br>
              补花 每朵花计1个花番 <br>
              一套或几套花时另计 <br>
              注：补的花如果为一套或几套时，只按套数计算花番，不再计单个花番；如果不够一套或几套时按单个花番计。如：花为4个东、春、秋，则花番为：6+1+1＝8番。 
              <br>
              以上番值是以赢家赢每个闲家的番数算，和牌者赢三家。 <br>
            </p></td>
        </tr>
      </table>
      
    <p>&nbsp;</p></td>
  </tr>
</table>
<!--#include file="../copy.asp" -->