<!--#include file="top.asp" -->
<table width="770" border="0" align="center" cellpadding="0" cellspacing="0">
  <tr> 
    <td bgcolor="F7F7F7">
      <table width="678" border="0" align="center" cellpadding="0" cellspacing="0" class="size">
        <tr>
          <td width="678" height="69" background="images/yxgz_08.gif"><div align="center">
              <table width="94%" height="41" border="0" cellpadding="0" cellspacing="0">
                <tr>
                  <td height="41" valign="bottom" background="default1_08.jpg" class="ZI">● 大众麻将游戏规则</td>
                  <td>&nbsp;</td>
                </tr>
              </table>
          </div></td>
        </tr>
        <tr>
          <td background="images/yxgz_10.gif"><p>大众麻将</p>
              <p>一：游戏介绍：</p>
              <p>麻将的规则体系发展历史源远流长，如今已经很难考证。据了解，目前主要规则便是鸡平胡、推倒胡、新章、老章这四大派系。</p>
              <p>二：规则介绍：</p>
              <p>相关术语：</p>
              <p>1、牌数：共一百三十六张：筒、索、万、东、南、西、北风、中、发、白， 没有 梅、兰、竹、菊、春、夏、秋、冬。</p>
              <p>2、摸牌：游戏在一开始，只有庄家可得到十四张牌，其余的人十三张。庄家从牌中选出一张最无用的牌丢出。此时，其它三家都有权力要那张丢出的牌。推倒胡麻将只允许碰牌，不允许吃牌。</p>
              <p>3、庄家：游戏中采用连庄方式，仅第一局为系统随机定庄，之后将由本局胡牌的玩家下局坐庄，如庄家胡牌，则继续连庄。如出现和牌，则庄家的下家上庄。 </p>
              <p>基本规则：</p>
              <p>和牌：即流局、荒牌</p>
              <p>漏胡：只允许自摸，不允许放炮，所以不存在漏胡。</p>
              <p>一炮多响：只允许自摸，不允许放炮，所以不存在一炮多响。</p>
              <p>抢杠： 玩家抢杠时将不能抢自己所打的牌，如：自己打出一张三条，有人杠，此时将无法对其进行抢杠操作。</p>
              <p>&nbsp;</p>
              <p>三：计分规则：</p>
              <p>1 、 基础分为 1 。</p>
              <p>2 、 自摸：基础分 *2 ，小胡：基础分 *1 ，大胡：基础分 *2 。</p>
              <p>3 、 放杠， 即玩家所出牌造成了其他人的杠牌，则该玩家将赔 3 分给杠牌者。</p>
              <p>4 、 明杠，某玩家摸牌后明杠牌（已有碰的牌继续杠）。在最后结算时，其余三家每人均赔给杠牌者 1 分 。</p>
              <p>5 、 暗杠，同自摸原理。某玩家暗杠后，在最后结算时，其余三家每人均赔给杠牌者 2 分。</p>
              <p>6 、 所有杠可以累积做加法计算。</p>
              <p>7 、 所有牌型之间不累积计算。</p>
              <p>8 、 抢杠胡，当玩家抢杠胡牌时将赢得 3 份分数（相当于自摸胡）。但这 3 份全部由杠牌者全全承担，与其他人无关。只有自摸导致的明杠才可以被抢，暗杠和别人放杠的不许抢。</p>
              <p>9 、 杠上开花，如玩家为自摸杠，所赢分数则由其他三位玩家平均分担（同自摸原理）。如为一家玩家放杠后，出现杠上花情况，则自摸玩家所赢的自摸分数将由放杠者全全承担。</p>
              <p>大胡牌型：</p>
              <p>天胡：庄家起牌后未出一手牌即胡牌，称为天胡。</p>
              <p>清一色、字一色：所胡牌中仅含有万、饼、条中间的一种则称为清一色。全为字则称为则一色。带有万、饼、条其中一种同时夹杂字牌的则称为混一色。</p>
              <p>七对子：所胡牌为 7 副将组成的即称为七对。有四张一样的牌，但没有杠可算做 2 幅将。</p>
              <p>四暗刻、十八罗汉：所胡牌没有碰牌，全由三张或（暗杠）组成的牌型，没有顺子牌，称为四暗刻。包括胡的牌，如果不是单调一张胡也必须算自摸才可（如以下牌型，自摸才算四暗刻）。当杠四手（不分明暗杠，但必须杠了四手）所胡的牌称为 &quot; 十八罗汉 &quot; 。</p>
              <p>大三元、小（大）四喜：所胡牌中带有中、发、白各三张或四张的牌型称之为大三元。所胡牌中带有东、南、西、北各三张或四张的牌型称之为大四喜。在东、南、西、北中其中一幅为将（ 2 张牌）其余的依然为三张或四张以上的牌型称为小四喜。</p>
              <p>十三幺：由东、南、西、北、中、发、白、一万、九万、一饼、九饼、幺鸡、九条，再额外加上以上 13 张牌中的任意一张牌组成的牌型既为十三幺。 </p>
              <p>积分算法：</p>
              <p>胜方：</p>
              <p>自摸和牌： 番数 × 3</p>
              <p>别人点炮和： 番数</p>
              <p>负方：</p>
              <p>点炮者： － 番数</p>
              <p>非点炮者： 0</p>
              <p>非自摸者：－ 番数</p>
              <p>&nbsp;</p>
              <p>四：积分等级</p>
              <p><br />
              </p>
              <p><img src="images/dzmj.gif" width="589" height="230"></p>
              <p><br>
            </p></td>
        </tr>
      </table>
      <table width="678" height="35" border="0" align="center" cellpadding="0" cellspacing="0">
      <tr>
        <td background="images/yxgz_12.gif">&nbsp;</td>
      </tr>
    </table>
    <p>&nbsp;</p></td>
  </tr>
</table>
<!--#include file="copy.asp" -->