<!--#include file="top.asp" -->
<table width="770" border="0" align="center" cellpadding="0" cellspacing="0">
  <tr> 
    <td bgcolor="F7F7F7">
<table width="678" border="0" align="center" cellpadding="0" cellspacing="0" class="size">
        <tr> 
          <td width="678" height="69"> <div align="center"> 
              <table width="94%" height="41" border="0" cellpadding="0" cellspacing="0">
                <tr> 
                  <td height="41" valign="bottom" class="ZI">● 十三张游戏规则</td>
                  <td>&nbsp;</td>
                </tr>
              </table>
            </div></td>
        </tr>
        <tr> 
          <td> 一副牌除去大小王，一共52张，分别分给其他玩家，采取庄闲制（轮流做庄，每人坐庄四盘，）,最多四个人玩，每人13张，把13张牌分别以头、中、尾同时摆出来斗大；大小顺序为：头〈中〈尾，按照这样的大小顺序任意摆出来，头分别为3张牌，中和尾各为5张牌，一共13张，俗称十三张. 
            违反大小顺序则称为乌龙，就当输家处理。<br>
            每盘最大压注数＝庄家金币数/12<br>
            例如庄家金币数为120000，3指闲家最大值，因为最大下注数是4盘之后换庄了才改的。所以，闲家每盘最大压注数为 120000/(3×4)＝10000 
            <br>
            1. 免摆牌型，任意花色组成的：A、K、Q、J、10、9、8、7、6、5、4、3、2、<br>
            这样的组列也称为一条龙。拿到这样的牌型直接帮摊牌，自动帮摆好的牌型为：头段 2、3、4 中段 5、6、7、8、9 尾段10、J、Q、K、A<br> 
            <br>
            最大的牌型排列：<br>
            同花顺（蛇杠）＞四张(四扛)＞三张（俘虏）＞花＞顺子（蛇）＞三散牌＞两对半＞一对牌＞单张（五张全是散牌）<br> <br>
            常见的比较大小规则<br>
            在牌面头段 有一张单牌相同(如AKJ和A95）的情况下，大家相同的牌对消，也就A对消, 就论第二张的最大牌做为比较，所以是AKJ赢; 
            如果头端３张牌都相同的情况下，如（AJ10和AJ10）就以在A的花色定大小. 头端有对的,比如（889和884）也是相同的对消，以剩下的一张单牌定大小．所以是８８９胜出．（注：头端没有顺子和同花顺，只以单张, 
            对牌, 三张；之间定大小）．中端和尾端也是如此；比如：中端QQ234和QQ789；一对Q对消,就以234和789之间按散牌的大小规则做比较，所以是QQ789胜出，再如：99A74和99A74，就以带有黑桃“9”的对子为大．例子如下：<br>
            l 头段庄家有 黑桃A，黑桃Q,方块5，闲家有方块A,方块Q,梅花6，这种情况不管‘A’和‘Q’的花色，比较5和6的点数大小，这种情况下是闲家的牌大。<br>
            l 头段庄家有 黑桃K，黑桃Q,方块6，闲家有方块A,方块Q,梅花5，这种情况下是不管Q的花色大小，比较双方点数最大的那张牌，从而得出结论是闲家的牌大（方块A&gt;黑桃K）。<br>
            l 头段庄家有 黑桃Q,红桃J,红桃8，闲家有红桃Q，方块J,黑桃8，这样子三个牌的点数相同的情况下，先比较点数最大的牌的花色，所以得出结论是庄家的牌大<br>
            2. 单张牌型大小为： A、K、Q、J、10、9、8、7、6、5、4、3、2、<br>
            3. 对牌的牌型大小是按照单张的大小为例、三张的也一样，四张都一样<br>
            4. 对牌的牌型为：相同的两张单张 比如：22.33.44.55.66等都为对牌<br>
            5. 三张的牌型为：相同的三张单张 比如：222.333.444.555等都为三张<br>
            6. 四张的牌型为：相同的四张单张 比如：2222.3333.4444等都为四张<br>
            7. 头段3张牌,最大牌型为三张，其中AAA为最大,下来为KKK;两对半最大的为AAK,下来为AAQ,散牌最大的为AKQ,下来为AKJ. 
            三张＞两对半＞散牌<br>
            8. 5张牌之中没有对的牌型也不构成同花和顺子就以散牌牌型处理，这个参照头段散牌大小比较方法。比如：庄家有黑桃2，红桃5，方块7，方块8，梅花10；闲家有红桃6，红桃9，方块J，方块Q，梅花3，庄家最大的单牌为10；而闲家最大的单牌为Q；所以结果为闲家的牌大。<br>
            9. 5张牌之中有一对牌的就是一对牌处理,比如:QQ987这样的牌型比五张的散牌大。<br>
            10. 5张牌之中有两对牌的，称为两对半，半为单张，两对+单张，比如:44`33`5和AA`QQ`6等这样牌类的牌型就称为两对半，它比一对带三个散牌大<br>
            11. 5张牌当中有三张和两张单牌的称为三散牌;比两对半的牌型大,比如:33345和JJJ89等这样的牌型就是三散牌.这个只要三张大就大了，不用理会剩下的两张散牌<br>
            12. 5张牌当中有三张带一对牌的称为俘虏;比三散牌型大;比如:77744和JJJ55等这样的牌型就叫做俘虏. 这个只要三张大就大了，不用理会剩下的一对牌的大小<br>
            13. 5张牌当中有四张的牌型称为杠牌,比俘虏的牌型大,比如22226和88883等这样的牌型就叫做四杠. 这个只要四张大就大了，不用理会剩下的那张散牌<br>
            14. 牌型大小顺序为：四张（四杠）＞三张（俘虏）＞花＞顺子（蛇）＞三散牌＞两对半＞一对牌＞单张，而 四杠＜同花顺（蛇杠）<br>
            15. 顺子：任意花色组成分别能连在一起的五张单牌为顺子，俗称：蛇<br>
            比如：红桃2、方块3、梅花4、梅花5、黑桃6等都称顺子 <br>
            注（只能从A`K`Q`J`10`9`8`7`6`5`4`3`2的顺序排列；比如：10`J`Q`K`A和A`2`3`4`5，而J`Q`K`A`2，Q`K`A`2`3, 
            K`A`2`3`4，都不算为顺子，只能算为散牌。<br> <br>
            16. 顺子的大小也是按照单张的大小排列顺序论大小,最大为含A的顺子（注：含A的顺子则比较A的花色，花色大的则大），再下来就是9`10`J`Q`K.因为以单张的Ａ最大做比较．如果是相同的顺子,就以顺子最大的单牌做比较；比如：两家都是56789，就以最大的单牌“9”论花色定大小． 
            <br>
            17. 中段和尾段的顺子与对牌的大小比较为：顺子（蛇）＞三散牌＞两对半＞一对牌＞单张．而：顺子＜花＜三张（俘虏）＜四张（四杠）＜同花顺（蛇杠）<br>
            18. 花：由一种花色组成的五张单牌称为花；比如：红桃的75438等等,是同花色的都是花.<br>
            19. 花色大小排列为： 黑桃＞红桃＞梅花＞方块。<br>
            不同花色之间的大小比较不管花色里面的牌的点数大小，只要花色大就大。<br>
            在相同的花色下，就与花色中点数最大的牌做比较；比如：红桃的‘4789J’和‘2356K’；拿其中一方的点数最大的牌‘J’和另一方的点数最大的牌‘K’进行点数大小比较，结果是‘2356K’胜出．<br>
            20. 同花顺（蛇杠）：由一种花色组成的顺子就称为同花顺；俗称蛇杠．比如由红桃组成的：56789等这样的牌型就是同花顺.如果两家都是同花顺的话，先看花色，如果花色大则大，如果花色相同，按顺子的大小规则进行比较。<br>
            21. 头中尾之间的大小比较规则如下：<br>
            l 如果头段有三张牌（例如三张J）,中段就必须要有三张Ｑ以上的牌型；简单就是下面的公式：三张Ｑ＜三张Ｋ＜三张Ａ＜顺子＜花＜三张（俘虏）＜四张（四杠）＜同花顺（蛇杠）；在这个范围中任意一种牌型都可以．（注：三张Ｑ、三张Ｋ、三张Ａ可以为三散牌牌型。）<br>
            l 如果头段和中段都是散牌，则拿头段点数最大的牌和中段点数最大的牌进行点数比较，点数大的就大（相当于拿中段点数最大的三个牌出来和头段的进行散牌比较，参照两个头段比较的规则）<br>
            l 如果头段和中段都是一对半，则拿头段的对子和中段的对子比较，如果对子不相同，则对子大的那一段就大，如果对子相同（这种情况很少发生，除非是新手），则拿头段的散牌和中段的点数最大的散牌进行比较，哪个大则哪一段大。<br>
            <br>
            </td>
        </tr>
      </table>
      
    <p>&nbsp;</p></td>
  </tr>
</table>
<!--#include file="../copy.asp" -->