<!--#include file="top.asp" -->
<table width="770" border="0" align="center" cellpadding="0" cellspacing="0">
  <tr> 
    <td bgcolor="F7F7F7">
<table width="678" border="0" align="center" cellpadding="0" cellspacing="0" class="size">
        <tr> 
          <td width="678" height="69" background="images/yxgz_08.gif"> <div align="center"> 
              <table width="94%" height="41" border="0" cellpadding="0" cellspacing="0">
                <tr> 
                  <td height="41" valign="bottom" background="default1_08.jpg" class="ZI">● 两副升级游戏规则</td>
                  <td>&nbsp;</td>
                </tr>
              </table>
          </div></td>
        </tr>
        <tr> 
          <td background="images/yxgz_10.gif">
		    <p>两副升级</p>
		    <p>一：相关术语：</p>
		    <p>分牌： 升级游戏中每张5、10和K是分牌，5代表5分，10代表10分，K也代表10分，一副牌共有100分，游戏中，每方都要尽量抓获这些分牌。扣在底牌中的分牌，在计算时如果庄家被对方扣底则要加倍计算。</p>
		    <p>底牌： 发牌结束后，打一副牌时每方得12张，剩余的6张为底牌。打两副牌时每方得牌25张，剩余的8张牌为底牌。在翻主后由庄家取走底牌，而替换成庄家不需要的同样张数的牌作为新的底牌重新扣下。如果底牌有分，则庄家应该尽量确保不被抓分方扣底。</p>
		    <p>庄家：每一局牌都有一方担任庄家，庄家具有扣底牌和第一轮的首先出牌权。第一局的庄家由翻主方担任。做庄家的目的是利用庄家特权，尽量不让对手得到分牌。一局结束后，新的庄家根据抓分方的得分确定。</p>
		    <p>对家： 拖拉机游戏共由4位游戏者参与，左右方和上下方互相合作，对家指互相合作的另一方。如左方的对家为右方，下方的对家为上方。</p>
		    <p>庄家方： 庄家与其对家组成庄家方。</p>
		    <p>抓分方： 与庄家方相对而言，如果上下方是庄家方，则左右方即为抓分方。相反，左右方为庄家方时，上下方即为抓分方。</p>
		    <p>级牌： 拖拉机游戏从打2开始不断拖拉机，每局结束时根据抓分方的得分确定拖拉机情况。当前庄家的级别就是级牌。例如：庄家开始时的级别为2，表示2是本局的级牌，所有级牌都是主牌。如果庄家的级别上升到了K，此时K就成为级牌。</p>
		    <p>主花色： 在发牌结束后，每方都可以根据牌情翻出级牌，最后翻出的级牌花色即为主花色。主花色牌都是主牌。</p>
		    <p>主牌： 主牌由大王和小王(Joker)、级牌、主花色牌构成。</p>
		    <p>副牌：除主牌以外，其它牌都是副牌。</p>
		    <p>对牌：两张同点同花色的牌称为一对牌。对牌只在打两副以上牌时出现。</p>
		    <p>拖拉机：同花色的相邻两对或更多的对构成拖拉机，级牌不能与相同花色的副牌构成拖拉机。</p>
		    <p>&nbsp;</p>
		    <p>二：规则介绍：</p>
		    <p>牌的分配：在玩两副牌的拖拉机游戏时，共有108张牌，发牌后每方得25张，剩余8张为底牌。在翻主结束后，底牌归庄家所有，庄家再根据牌情任意抽取8张作为底牌。</p>
		    <p>牌的大小：</p>
		    <p>牌的大小按下列顺序排列：</p>
		    <p>　　 大王(红色Joker) </p>
		    <p>　　 小王(黑色Joker) </p>
		    <p>　　 主花色级牌</p>
		    <p>　　 其它花色级牌</p>
		    <p>　　 主花色牌(级牌除外)，A最大，K次之，... 2最小</p>
		    <p>　　 副牌(级牌除外)，A最大，K次之，... 2最小</p>
		    <p>　　 若首家出包含对的副牌，其它方即使全部出了主牌，但没有对，也不能算大。</p>
		    <p>出牌规则： 第一轮牌由庄家方首先出牌； 以后每轮牌都由前轮获胜方首先出牌； 如果不是首家出牌方，则在出牌时必须先出首家出的花色。如：首家出了红桃，则如果用户有红桃必须先出红桃；</p>
		    <p>在没有首家牌出牌的花色时，可以用主牌杀掉或垫其他花色牌； </p>
		    <p>首家可以单独出拖拉机、对和单牌；</p>
		    <p>首家可以出同花色中的拖拉机、对和单牌的任意组合，但必须保证最大性；</p>
		    <p>如果首家出牌中包含拖拉机，则其它方如果有同花色的拖拉机，必须出拖拉机；</p>
		    <p>如果首家出牌中包含对，则其它方如果有同花色的对，必须出对；</p>
		    <p>如果首家出牌中包含了拖拉机或对时，其它方试图用主牌毙时必须也要出相应数量的拖拉机和对；</p>
		    <p>各方都出牌后，计算获胜方，下一轮牌由获胜方首先出牌。</p>
		    <p>&nbsp;</p>
		    <p>三：胜负判定</p>
		    <p>根据抓分方最后的得分，确定了拖拉机的结果</p>
		    <p>如果得分为0，一副牌时庄家方连升2级；两副牌时庄家方连升3级；</p>
		    <p>如果得分不满40，一副牌时庄家方升1级；两副牌时庄家方连升2级；</p>
		    <p>如果得分大于等于40小于80，一副牌时双方不拖拉机，轮换庄家；两副牌时庄家方升1级；</p>
		    <p>如果得分大于等于80小于120，一副牌时抓分方80--95分升一级，100分升两级；两副牌时抓分方升1级。</p>
		    <p>如果得分大于等于120，小于160，两副牌时抓分方连升2级； </p>
		    <p>以后依次类推，两副牌时每增加40分，则多升一级。</p>
		    <p>&nbsp;</p>
		    <p>四：积分等级</p>
		    <p><br />
            </p>
		    <p><img src="images/lfsj.gif" width="589" height="207"></p>
		  <p><br>
          </p></td>
        </tr>
      </table>
      
    <table width="678" height="35" border="0" align="center" cellpadding="0" cellspacing="0">
      <tr>
        <td background="images/yxgz_12.gif">&nbsp;</td>
      </tr>
    </table>
    <p>&nbsp;</p></td>
  </tr>
</table>
<!--#include file="copy.asp" -->