<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=gb2312">
<title>拱猪游戏规则</title>
<link href="../css.css" rel="stylesheet" type="text/css">
</head>
<body leftmargin="0" topmargin="0" marginwidth="0" marginheight="0">
<!--#include file="top.asp" -->
<table width="735" border="0" align="center" cellpadding="0" cellspacing="0">
  <tr> 
    <td bgcolor="F7F7F7">
<p>&nbsp;</p><table width="678" border="0" align="center" cellpadding="0" cellspacing="0">
        <tr>
          <td height="69" background="images/yxgz_08.gif"> 
            <div align="center">
              <table width="92%" height="40" border="0" cellpadding="0" cellspacing="0">
                <tr>
                  <td valign="bottom" class="ZI">● 拱猪游戏规则</td>
                  <td>&nbsp;</td>
                </tr>
              </table>
            </div></td>
        </tr>
        <tr> 
          <td background="images/yxgz_10.gif">
<div align="center">
              <table width="88%" border="0" cellpadding="0" cellspacing="0" class="ZI">
                <tr>
                  <td> <br>
                    一．游戏概述
                    <p>拱猪是国内极为流行的一种扑克牌游戏。四个人使用一副牌或者两副牌。在游戏中，应尽量避免拿到红桃牌和黑桃Q，因为这些牌在游戏中算负分，而拱猪是以负分最少方为赢家。</p>
                    <p>二．游戏规则</p>
                    <p>1 一副牌规则</p>
                    <p>发牌：<br>
                      使用去掉大小王后的 52 张牌，由系统随机发给 4 个玩家。 </p>
                    <p>牌的大小：<br>
                      大小按如下顺序递减： A 、 K 、 Q 、 J 、 10 、 9 、 8 、 7 、 6 、 5 、 4 、 
                      3 、 2 </p>
                    <p>猪、羊、变压器：<br>
                      Q 代表“猪”， J 代表“羊”， 10 代表“变压器” </p>
                    <p>亮牌：<br>
                      也叫卖牌。开始出牌前，玩家将手中的猪 ( Q) 、羊 ( J ) 、变压器 ( 10 ) 、 A 亮出来，这些牌的分值加倍。在一副牌的 
                      4 张中如果有 3 张已经亮过，则第 4 张自动亮出来。 </p>
                    <p>分牌：<br>
                      分牌就是有分的牌，包括“猪” Q ，“羊” J ，“变压器” 10 ，所有红桃。<br>
                      “猪” Q 是负 100 分，如果卖过则是负 200 分。<br>
                      “羊” J 是正 100 分，如果卖过则是正 200 分。<br>
                      2 、 3 、 4 算 0 分。<br>
                      5 、 6 、 7 、 8 、 9 、 10 每个负 10 分。<br>
                      J 负 20 ， Q 负 30 ， K 负 40 ， A 负 50。<br>
                      如果 A 卖过，则所有红桃的分数加倍。<br>
                      得到 “变压器” 10 的玩家，手中其他牌的分数之和 *2 ，如果 10 卖过，则 *4。<br>
                      如果玩家手中除了 10 没有其他分牌，则得正 50 分，如果卖过则得正 100 分。<br>
                      注意：如果除了 10 ，还有其他分牌，且其他分数之和为 0 ，则总分数记为 0。</p>
                    <p>出牌： <br>
                      一次只能出一张。 第一局游戏由得到 2 的一方首先出牌，并且必须出 2 ；以后每局由上一局得到猪牌 ( Q ) 
                      的一方首先出牌。<br>
                      后面的玩家必须和首家出相同花色的牌，如果没有该花色，可以垫其他花色的牌。一轮出牌后，最大方得到该轮的所有分牌，垫其他花色者算最小。<br>
                      亮过的牌不能在该花色首轮出牌时出，但在出其他花色时可以垫。玩家该花色只有一张牌时，则不论是否亮过都必须出。</p>
                    <p>满红： <br>
                      如果一方在一轮游戏结束时将全部红桃收到自己手中，称为满红。注意要收齐 13 张红桃，包括 2 、 3 、 4 。 
                      一副牌的情况下：此时得到正 200 分。如果 A 亮过牌，则得正 400 分。 </p>
                    <p>满贯： <br>
                      如果一方在一轮游戏结束时将全部含有分值的牌都收齐了，称为满贯。一副牌的情况下，得 800 分。如果有亮牌，则相应加倍计算。 
                    </p>
                    <p>得分计算： <br>
                      一局结束后计算得分，先按上面的算法计算出每个玩家的原始分，然后将四家的分数进行处理，使 4 家人得分之和为 0 
                      ，并将其作为玩家的最后得分。<br>
                      具体算法：某玩家最后得分 = 该玩家原始分 – ( 其他 3 家原始分之和 ) / 3<br>
                      例如，玩家 A 、 B 、 C 、 D 的原始分分别为 -120 、 -280 、 0 、 160 <br>
                      A 的最后得分 = -120 – (-280 + 0 + 160) / 3 = -80<br>
                      B 的最后得分 = -280 – (-120 + 0 + 160) / 3 = -293<br>
                      C 的最后得分 = 0 – (-120 + (-280) + 160) / 3 = 80<br>
                      D 的最后得分 = 160 – (-120 + (-280) + 0) / 3 = 293<br>
                      由于两副牌拱猪每盘得分都很高，为了平衡分数，一副牌拱猪的得分都乘 12 再加到玩家的积分中去。<br>
                      则上面例子中 4 玩家最后得分分别为： -960, -3516, 960, 3516 </p>
                    <p>2 两副牌规则 </p>
                    <p>发牌： <br>
                      使用两副牌，去掉大小王一共 104 张，由系统随机发给 4 个玩家。 </p>
                    <p>亮牌： <br>
                      Q 亮了一张后，两张 Q 的分数都为负 200 ，如果两张都亮了，则每张的分为负 400 <br>
                      J 亮了一张后，两张 J 的分数都为正 200 ，如果两张都亮了，则每张的分为正 400<br>
                      10 亮了一张后，得任意一张分数 * 4 ，两张都得，分数 * 8 <br>
                      两张 10 都亮了，得任意一张分数 * 4, 两张都得，分数 * 16 <br>
                      A 亮一张后，所有红桃分数 * 2 ；如果亮两张，所有红桃分数 * 4 <br>
                      例如：两张 10 都亮，两张 A 都亮 ， 两张 Q 都亮 <br>
                      某玩家得到 A 、 10 、 10 ，则原始分为 –3200 <br>
                      某玩家得到 Q 、 Q 、 10 、 10 ，则原始分为 –12800 </p>
                    <p>满红： <br>
                      如果一方在一轮游戏结束时将全部红桃收到自己手中，称为满红。注意必须把两副牌 26 张红桃全部收齐。此时得正 400 
                      分。如果 A 亮过一张牌，则得正 800 分，如果两张 A 都亮过，则得正 1600 分。 </p>
                    <p>满贯： <br>
                      如果一方在一轮游戏结束时将全部含有分值的牌都收齐了，称为满贯。注意必须把两副牌的都收齐。得 1600 分。如果有亮牌，则相应加倍计算。 
                    </p>
                    <p>出牌： <br>
                      第一局游戏由得到第一个 2 的一方首先出牌（由系统判断谁先得到第一张），并且必须出 2 ；以后每局由上一局第一个得到猪牌 
                      ( Q ) 的一方首先出牌。<br>
                      首家出牌的可以出一张或者一对。<br>
                      后面的玩家该花色如果有对必须跟对。<br>
                      没有该花色的垫其他花色的算最小。<br>
                      对 三门牌，对子小于两张单牌。 牌中，对子大于两张单牌。<br>
                      例如： A 、 B 、 C 、 D <br>
                      玩家 出的牌 大小排名 <br>
                      A 4 4 3 <br>
                      B K K 2 <br>
                      C Q 8 1 <br>
                      D J K 4 <br>
                      则上面玩家 C 最大，将 Q K 收到手中。 <br>
                      亮过的牌不能在该花色首轮出牌时出，如果 Q 只亮过一张，则亮过的这张首轮不能出，没亮过的那张可以出。 J 、 10 
                      、 A 也一样。 </p>
                    <p>3 打对家规则 </p>
                    <p>打对家时对着坐的两家合作。<br>
                      和普通游戏规则完全相同，只是最后算分时不同。 <br>
                      具体算分规则如下：<br>
                      玩家 A 、 B 、 C 、 D 的原始分数分别为 a 、 b 、 c 、 d ，其中 A 和 C 对着坐，是一家的。<br>
                      则 AC 联合的原始分为 a+c ， BD 联合的原始分为 b+d <br>
                      处理后 A 、 C 的得分都是 (a+c-(b+d))/2 ， B 和 D 的得分都是 (b+d-(a+c))/2 
                      <br>
                      如果是一副牌，还要将分数都 *12 <br>
                      例如：玩家 A 、 B 、 C 、 D 的原始分分别为 -190 50 –10 0 <br>
                      为使两边分数之和为 0 ，处理后有 AC 分为 -125, BD 为 125 <br>
                      为和两副牌平衡分数，乘以 12 后 ABCD 得分分别为： -1500 ， 1500 ， -1500 ， 1500 
                    </p>
                    <p>三．级别</p>
                    <p>八戒 -50000000<br>
                      猪圣 -10000000<br>
                      猪神 -5000000<br>
                      猪王 -1000000<br>
                      乳猪格格 -700000<br>
                      野猪 -500000<br>
                      架子猪 -300000<br>
                      微型猪 -100000<br>
                      猪小弟 0<br>
                      猪倌 10000<br>
                      猎人 50000<br>
                      屠夫 100000<br>
                      饲养员 200000<br>
                      优秀饲养员 300000<br>
                      养猪专业户 400000<br>
                      地主 600000<br>
                      知县 800000<br>
                      知州 1000000<br>
                      知府 3000000<br>
                      巡抚 5000000<br>
                      大学士 7000000<br>
                      宰相 10000000<br>
                      王爷 50000000<br>
                      帝王 100000000 </p>
                    <p>游戏币场计算规则 </p>
                    <p>游戏币是QQ游戏中使用的虚拟游戏数据。本游戏分为普通计分和游戏币计分两种场次，在游戏币计分场中以游戏币为计分单位 
                      ，完成一局游戏后玩家的游戏币可能会发生变化。 </p>
                    <p>具体计算方法为 </p>
                    <p>失败玩家的游戏币变化：X×12×N </p>
                    <p>胜利玩家的游戏币变化：X×12×N×0.9 </p>
                    <p>其中： </p>
                    <p>N为游戏币场房间系数 </p>
                    <p>X为游戏基数，计算方式为： <br>
                      一局结束后计算牌分，先按上面的算法计算出每个玩家的原始牌分，然后将四家的分数进行处理，使 4 家人得分之和为 0 
                      ，并将其作为玩家的游戏基数 X 。 <br>
                      具体算法：某玩家 X = 该玩家原始牌分 – ( 其他 3 家原始牌分之和 ) / 3 </p>
                    <p><br>
                      例如 </p>
                    <p>玩家 A 、 B 、 C 、 D 的原始牌分分别为 -120 、 -280 、 0 、 160 <br>
                      A 的游戏基数 = -120 – (-280 + 0 + 160) / 3 = -80 <br>
                      B 的游戏基数 = -280 – (-120 + 0 + 160) / 3 = -293 <br>
                      C 的游戏基数 = 0 – (-120 + (-280) + 160) / 3 = 80 <br>
                      D 的游戏基数 = 160 – (-120 + (-280) + 0) / 3 = 293 </p>
                    <p><br>
                      如果 N （房间系数）＝ 1 ，则 <br>
                      则上面例子中胜利的玩家 C 奖励的游戏币＝ 80 × 12 × 1 × 0.9 ＝ 864 游戏币 </p>
                    <p>上面例子中失败的玩家 A 消耗的游戏币＝ 80 × 12 × 1 ＝ 960 游戏币 </p> <br> <br> <br> </td>
                </tr>
              </table>
              
            </div></td>
        </tr>
        <tr>
          <td width="678">
<div align="center"><img src="images/yxgz_12.gif" width="678" height="35"></div></td>
        </tr>
      </table>
      
    <p>&nbsp;</p></td>
  </tr>
</table>
<!--#include file="../copy.asp" -->
</body>
</html>
