<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=gb2312">
<title>余姚麻将游戏规则</title>
<link href="../css.css" rel="stylesheet" type="text/css">
</head>
<body leftmargin="0" topmargin="0" marginwidth="0" marginheight="0">
<!--#include file="top.asp" -->
<table width="735" border="0" align="center" cellpadding="0" cellspacing="0">
  <tr> 
    <td bgcolor="F7F7F7">
<p>&nbsp;</p><table width="678" border="0" align="center" cellpadding="0" cellspacing="0">
        <tr>
          <td height="69" background="images/yxgz_08.gif"> 
            <div align="center">
              <table width="92%" height="40" border="0" cellpadding="0" cellspacing="0">
                <tr>
                  <td valign="bottom" class="ZI">● 余姚麻将游戏规则 </td>
                  <td>&nbsp;</td>
                </tr>
              </table>
            </div></td>
        </tr>
        <tr> 
          <td background="images/yxgz_10.gif">
<div align="center">
              <table width="88%" border="0" cellpadding="0" cellspacing="0" class="ZI">
                <tr>
                  <td> <br>
                    　　--游戏起源、历史、简介<br>
                    　　麻将原称“麻雀”，中华民国初年，麻将由大陆传入台湾，慢慢的从广东的十三张，演变成台湾的十六张玩法。 各地根据风俗习惯和文化底蕴，麻将的规则也很不统一，进而又产生出各地不同的玩法，这里介绍的是余姚麻将。 
                    <p>　　--进入游戏<br>
                      　　首先联入Internet后，由&quot;游戏大厅&quot;选择牌类游戏中的余姚麻将，登录后进入游戏室，然后可自由选择对手，坐下并选择&quot;开始&quot;后就可以开始打牌。也可以在其他牌桌观看，只要用鼠标单击正在打牌中的人物图像即可。</p>
                    <p>　　--详细规则 <br>
                      　　一、游戏在一开始，只有庄家可得到十四张牌，其余的人十三张。庄家从牌中选出一张最无用的牌丢出，此时，其它三家都有权力要那张丢出的牌。庄家的下家（右手边的玩者），有权力吃或碰或杠那张牌，其它两家则只可碰或杠那张牌。“碰”比“吃”优先。碰牌要快，要在3秒之内报出。余姚麻将实行轮庄制，即上一圈的胡牌者担任庄家。庄家连胡可冲二老庄, 
                      二老庄胡牌可冲三老庄.以此类推。被别的玩家胡走后，轮下家担任庄家。</p>
                    <p>　　二、胡牌的要求 <br>
                      　　（一）胡牌者的牌型必须具备下列牌型之一：<br>
                      　　1、胡牌的基本牌型<br>
                      　　① 11、123、123、123、123<br>
                      　　② 11、123、123、123、111(1111，下同)<br>
                      　　③ 11、123、123、111、111<br>
                      　　④ 11、123、111、111、111<br>
                      　　⑤ 11、111、111、111、111<br>
                      　　2、胡牌的特殊牌型<br>
                      　　① 11、11、11、11、11、11、11(七对)<br>
                      　　②不搭（胡牌者不可以同时拥有三个可以连123的牌，不可以吃碰杠，财神可以当任何牌；比如147，而146就不行。。因为456是可以连在一起的，东南西北中发白可以放在一起） 
                      <br>
                      　　（二）余姚麻将里的“抛花麻”，即你的11，123，123，123，123一对（11）中有一个是财神，那你下一圈随便抓任何一张牌都可以胡牌了，那这时候你的胡牌就称做：“抛花麻”，“抛花麻”的分是本来糊牌分*2。<br>
                      　　（三）如果你有杠。在你听牌或要“抛花麻”的时候杠了你要胡的牌，那分数在胡牌时+1。如这时再.飘财神则再加一倍。 
                      <br>
                      　　（四）拿牌和财神余姚麻将里财神是根据每轮庄家扔色子后的数字，按逆时针方向数，确定拿牌的牌家位置。然后按顺时针方向数这个数，开始拿牌；<br>
                      　　 从拿牌这家的下家按逆时针来翻相应的牌确定的，翻的那张牌就是财神的弟弟，所以余姚麻将的财神有4个。<br>
                      　　（比如：我是庄。我扔出的色子是3、7就是十，按逆时针方向数十，就是庄的下家为拿牌开始牌家位置，按顺时针数十拿牌。每次四张。最后庄拿上面隔开的两张即14张，其他三家各按序拿一张既13张；财神弟弟就是拿牌这家的下家逆时针数，第10张翻，如果翻出来是4万，财神就是5万，如果翻出来是9万，那就是1万，翻东财神就是南，翻北财神就是东，翻红中财神就是发，翻发财神就是白板，翻白板财神就是红中）<br>
                      　　（五）如果上家打牌出来，可以糊而没糊，那么这轮内别人打也不可以糊牌； </p>
                    <p>　　三、承包<br>
                      　　余姚麻将有承包规则：有人吃（包括碰）了你3次，最后他胡了，那就是你要承包所有的分。反之,如果你糊了,他要承包双倍的所有的分.</p>
                    <p>　　四、胡牌大小<br>
                      　　1、清一色:积分和银子×2<br>
                      　　没有财神而糊牌的×4<br>
                      　　七对子:(11、11、11、11、11、11、11)×2,清七对:(不带财神)×4<br>
                      　　抓麻雀：即牌全部吃出或碰出,×2<br>
                      　　2、如果庄家胡则闲家给庄家胡牌大小×2，庄家二老庄则积分和银子×4，三老庄则记分和银子×8，以此类推。闲家给庄家连庄次数×胡牌大小的分值。反之，如闲家和，庄家给闲家连庄次数×胡牌大小的分值，其余闲家也按连庄次数×胡牌大小的分值给糊牌的闲家；<br>
                      <br>
                    </p></td>
                </tr>
              </table>
              
            </div></td>
        </tr>
        <tr>
          <td width="678">
<div align="center"><img src="images/yxgz_12.gif" width="678" height="35"></div></td>
        </tr>
      </table>
      
    <p>&nbsp;</p></td>
  </tr>
</table>
<!--#include file="../copy.asp" -->
</body>
</html>
