<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=gb2312">
<title>拖拉机游戏规则</title>
<link href="../css.css" rel="stylesheet" type="text/css">
</head>
<body leftmargin="0" topmargin="0" marginwidth="0" marginheight="0">
<!--#include file="top.asp" -->
<table width="735" border="0" align="center" cellpadding="0" cellspacing="0">
  <tr> 
    <td bgcolor="F7F7F7">
<p>&nbsp;</p><table width="678" border="0" align="center" cellpadding="0" cellspacing="0">
        <tr>
          <td height="69" background="images/yxgz_08.gif"> 
            <div align="center">
              <table width="92%" height="40" border="0" cellpadding="0" cellspacing="0">
                <tr>
                  <td valign="bottom" class="ZI">● 拖拉机游戏规则</td>
                  <td>&nbsp;</td>
                </tr>
              </table>
            </div></td>
        </tr>
        <tr> 
          <td background="images/yxgz_10.gif">
<div align="center">
              <table width="88%" border="0" cellpadding="0" cellspacing="0" class="ZI">
                <tr>
                  <td> <br>
                    【 拖拉机简介 】 
                    <p>拖拉机是国内非常盛行的一种 4 人扑克牌游戏，可以选择一副牌、两副牌或者三副牌进行。打一副牌时，也称为 &quot;40 
                      分 &quot; 或 &quot; 打百分 &quot; ；打两副牌时，也称为 &quot;80 分 &quot; 
                      ，还有的地方也有叫 &quot; 摔小二 &quot; 、 &quot; 拖拉机 &quot; 等。 </p>
                    <p>拖拉机 ( 两副牌 ) 介绍： <br>
                      和 “ 拖拉机 ” 一样，牌局采用四人结对竞赛，抢分拖拉机的方式进行。基本规则也和 “ 拖拉机 ” 相似。具有规则简明、对抗性强等特点。 
                      “ 拖拉机 ” 在保留 “ 拖拉机 ” 的上述优点的同时，增加了牌的张数（由 54 张变为 108 张〕，取消了对底牌压分的限制，使牌局的变化更为丰富。 
                      “ 对牌 ” 、 “ 拖拉机 ” （这也是 “ 拖拉机 ” 这一游戏名称的由来〕等出牌形式和 “ 双抠翻倍 ” 
                      等规则的增加，使牌局更富有娱乐性和刺激性。 </p>
                    <p>（注：下面所举的例子除特殊说明外以打 10 为例） </p>
                    <p>【 牌的大小顺序 】 </p>
                    <p>2 不为常主时 </p>
                    <p>主牌从大至小依次为： <br>
                      大王 , 小王 , 主 10, 副 10,A,K,Q,J,9,8,7,6,5,4,3,2 <br>
                      副牌从大至小依次为： <br>
                      A,K,Q,J,9,8,7,6,5,4,3,2 </p>
                    <p>2 为常主时 </p>
                    <p>主牌从大至小依次为： <br>
                      大王 , 小王 , 主 10, 副 10, 主 2, 副 2,A,K,Q,J,9,8,7,6,5,4,3 <br>
                      副牌从大至小依次为： <br>
                      A,K,Q,J,9,8,7,6,5,4,3 </p>
                    <p>【 拖拉机的构成 】 </p>
                    <p>凡大小顺序相邻且花色相同的联对均构成拖拉机，如： <br>
                      KKQQ,JJ99,554433 ； </p>
                    <p>主牌中凡大小顺序相邻联对均构成拖拉机，如： <br>
                      一对小王带一对主 10, 一对主 10 带一对副 10 <br>
                      一对副 10 带一对主牌 A, 一对主 10 带一对副 10 及一对主牌 A </p>
                    <p>以下各例均不是拖拉机： <br>
                      554,544,5533,JJQ ，两对副 10,JJ1010,AA22 </p>
                    <p>【 亮牌规则 】 </p>
                    <p>在发牌过程中，第一次亮出的 10 的花色作为主牌花色。 </p>
                    <p>有以下几种情况可改变或加强主牌花色： </p>
                    <p>反无主 <br>
                      自保 <br>
                      反主 <br>
                      自反 </p>
                    <p>以上后三条以先出现者为准。 </p>
                    <p>若发牌结束仍无人亮牌，则打无主。 </p>
                    <p>【 出牌规则 】 </p>
                    <p>出牌时同等大小的牌以先出者为大。 </p>
                    <p>同门花色的大牌可以联出，称作 “ 甩牌 ” 如： <br>
                      副牌中： AAK ， AKK ， AQQJJ ， 98844 （若其他家中无人有能大过一张 9 ，和一对 8 ，和一对 
                      4 的牌）。 </p>
                    <p>若首家试图联出的牌并非都是大牌时，则其必须出欲联出的牌中的最小牌。如： <br>
                      首家试图联出 98844 时，若其余某家有此花色的 J ，则首家必须出 9 ，若其余某家有此花色的 QQ 或 55 
                      ，则首家必须出 44 。 <br>
                      首家出对牌时，其余家有对牌必须出对牌（包括拖拉机中的对牌）首家出拖拉机时，其余家有拖拉机必须出拖拉机，若无拖拉机，则必须出对牌，无对牌时才能出其它牌。 
                    </p>
                    <p>首家出某花色副牌时，其余家无此门花色时，可出主牌，称为 “ 毙 ” 。若首家出的牌中有拖拉机或对牌，毙牌时所出的牌必须是主牌，且其拖拉机的数目不得少于首家出的牌中的拖拉机的数目，对牌的数目也不得少于首家出的牌中的对牌的数目，否则被视为垫牌。 
                    </p>
                    <p>出现多家毙牌时，毙牌的大小以毙牌中的拖拉机和对牌大小为准，大的称为 “ 盖毙 ” 。如： <br>
                      主牌 9988 72 可毙副牌 AK5544, 但不能毙副牌 AA5544 <br>
                      主牌 977 可毙副牌 544, 主牌 884 可盖毙 <br>
                      主牌 977 可毙副牌 567, 主牌 884 不能盖毙 </p>
                    <p>【 轮庄规则 】 </p>
                    <p>开局中，双方争庄，先亮者为庄家。 <br>
                      庄家拖拉机时，下一副牌由其对家当庄家。 <br>
                      闲家上台时，下一副牌由此副牌的庄家的下家当庄家。 </p>
                    <p>【 记分规则 】 </p>
                    <p>拖拉机所需分数规定：以两副牌为例： <br>
                      如果得分为 0 ，庄家方连升 3 级； <br>
                      如果得分不满 40 ，庄家连升 2 级； <br>
                      如果得分大于等于 40 小于 80 ，庄家方升 1 级； <br>
                      如果得分大于等于 80 小于 120 ，轮换庄家； <br>
                      如果得分大于等于 120 小于 160 ，抓分方升 1 级； <br>
                      如果得分大于等于 160 小于 200 ，抓分方连升 2 级； <br>
                      以后以 40 分为一个等级抓分方升相应等级 </p>
                    <p>一副牌与三副牌的分数规定类似，只是一副牌的分数段为 20 分一段，三副牌的分数段为 60 分一段； </p>
                    <p> </p>
                    <p>【三副牌规则】 </p>
                    <p>【 亮主规则 】 </p>
                    <p>和两副牌拖拉机规则类似，亮主实行 &quot; 抢亮 &quot; 的规则。四位玩家中任意一位亮了合法的牌后，其它玩家就不能再亮同级别或该级别以下的牌了。三幅牌拖拉机（下称泰坦尼克）中的亮主级别如下：（假定当前打 
                      10 ） </p>
                    <p>单张 10 <br>
                      两张 10 <br>
                      两张王（打无主） <br>
                      三张 10 <br>
                      三张王（打无主） </p>
                    <p>【 新增牌型 】 </p>
                    <p>※泰坦尼克 </p>
                    <p>两副大小相临花色相同的三同张。当打 5 时，下列情况为泰坦尼克： 3334 44 ， 444666 ，副 5 
                      主 5 ，大王小王， AAA 副 5 ，主 5 小王 …… </p>
                    <p>当打 5 时下列情况不为泰坦尼克： 555666 当打无主时下列情况不为泰坦尼克： 555555 </p>
                    <p>【 出牌规则 】 </p>
                    <p>泰坦尼克 其它玩家根据牌情按如下顺序出牌： </p>
                    <p>泰坦尼克 </p>
                    <p>一副拖拉机 + 任意两张 <br>
                      两副三同张 <br>
                      一副三同张 + 一副对子 + 一单张 <br>
                      一副三同张 + 三单张 <br>
                      两副对子 + 两单张 <br>
                      一副对子 + 四单张 <br>
                      六单张 </p>
                    <p>三同张 其它玩家根据牌情按如下顺序出牌： </p>
                    <p>三同张 <br>
                      一副对子 + 一单张 <br>
                      三单张 </p>
                    <p>【 记分规则 】 </p>
                    <p>0 分记大光，不足 60 分算小光， 120 分上台， 180 分上台 +1 级， 240 分上台 +2 级跑分一方打成大光升 
                      3 级，小光升 2 级，满 120 分下台得分方打成 120 分上台，之后每满 60 分加一级。 </p>
                    <p>得分方打成 120 分上台，每超过 60 分加一级。 </p>
                    <p> </p>
                    <p>以下两条规则三副牌两副牌通用。 </p>
                    <p>【 扣底规则 】 </p>
                    <p> </p>
                    <p>最后一圈牌如果是庄家方大，不抠底。否则根据最后一圈牌的最大牌型的牌张数扣底。 </p>
                    <p>假设最后一圈牌最大牌型为对子 44 ，则最大牌型的牌张数为 2 ，则抠底分倍数为 2 的 2 字方，为 4 倍。 
                    </p>
                    <p>最大 64 倍。 </p>
                    <p>具体例子如下： </p>
                    <p>闲家用 444555 抠底，翻 2 × 2 × 2 × 2 × 2 × 2 ＝ 64 倍 </p>
                    <p>闲家用 445566 抠底，翻 64 倍。 </p>
                    <p>闲家用 4455 抠底，翻 16 倍 </p>
                    <p>闲家用 555 抠底，翻 8 倍。 </p>
                    <p>如果最后一圈牌为甩牌，只根据甩牌中的最大牌型计算抠底倍数。 </p>
                    <p>比如闲家用甩牌 AKQJ 10 9 8 77 扣底，抠底倍数根据对子 77 计算，为 4 倍。 </p>
                    <p>闲家用 AKQJ 甩牌抠底，抠底倍数根据单牌计算，为 2 倍。 </p>
                    <p>闲家用甩牌 AAJJ 甩牌抠底，抠底倍数按对子计算，为 4 倍。 </p>
                    <p> </p>
                    <p>【 积分规则 】 </p>
                    <p>根据房间不同有不同的配置，普遍的规则为， </p>
                    <p>闲家转庄家得两分，以上每升一级加一分。 </p>
                    <p>庄家升一级得两分，以上每升一级加一分，最多闲家大光时得四分。 </p>
                    <p>特殊房间配置：大光积分特殊配置房间，在进入游戏的时候会在聊天框提醒您是大光积分增减情况。根据配置不同而不同。 
                    </p>
                    <p> </p>
                    <p>如果一局游戏四个玩家积分都在 80 分以上， 300 分以下，在以上基础上该局游戏积分输赢翻倍。 </p>
                    <p>如果四个玩家积分都在 300 分以上，在以上基础上翻 3 倍。 </p>
                    <p> </p>
                    <p>例如：四个玩家积分都是 90 ，某局游戏庄家打闲家大光，本来积分是庄家＋ 4 分，闲家－ 4 分，根据积分翻倍，积分为庄家＋ 
                      8 分，闲家－ 8 分。 </p>
                    <p>如果四个玩家都是 400 分，相同游戏结果，积分翻 3 倍为庄家＋ 12 分，闲家－ 12 分。如果该游戏房间又为大光积分特殊配置房间，比如大光积分配置为庄家＋ 
                      6 分，闲家－ 6 分，则翻三倍结果为庄家＋ 18 分，闲家－ 18 分。 </p>
                    <p> </p>
                    <p>游戏币场计算规则 </p>
                    <p>游戏币是QQ游戏中使用的虚拟游戏数据。本游戏分为普通计分和游戏币计分两种场次，在游戏币计分场中以游戏币为计分单位 
                      ，完成一局游戏后玩家的游戏币可能会发生变化。 </p>
                    <p>具体计算方法为 </p>
                    <p>失败玩家的游戏币消耗：X×N </p>
                    <p>胜利玩家的游戏币奖励：X×N×0.9 </p>
                    <p>其中： </p>
                    <p>N为游戏币场房间系数 </p>
                    <p>X为游戏基数，计算方式为： </p>
                    <p>庄家赢：X＝Y＋1 </p>
                    <p>闲家赢：X＝Y＋2 </p>
                    <p>例如： </p>
                    <p>N（房间系数）＝1000，庄家胜利，升2级， </p>
                    <p>则庄家奖励的游戏币＝（2＋1）×1000×0.9＝2700游戏币 </p>
                    <p>闲家消耗的游戏币＝（2＋1）×1000＝ 3000游戏币<br>
                    </p>
                    <br> <br> </td>
                </tr>
              </table>
              
            </div></td>
        </tr>
        <tr>
          <td width="678">
<div align="center"><img src="images/yxgz_12.gif" width="678" height="35"></div></td>
        </tr>
      </table>
      
    <p>&nbsp;</p></td>
  </tr>
</table>
<!--#include file="../copy.asp" -->
</body>
</html>
