<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=gb2312">
<title>五子棋游戏规则</title>
<link href="../css.css" rel="stylesheet" type="text/css">
</head>
<body leftmargin="0" topmargin="0" marginwidth="0" marginheight="0">
<!--#include file="top.asp" -->
<table width="735" border="0" align="center" cellpadding="0" cellspacing="0">
  <tr> 
    <td bgcolor="F7F7F7">
<p>&nbsp;</p><table width="678" border="0" align="center" cellpadding="0" cellspacing="0">
        <tr>
          <td height="69" background="images/yxgz_08.gif"> 
            <div align="center">
              <table width="92%" height="40" border="0" cellpadding="0" cellspacing="0">
                <tr>
                  <td valign="bottom" class="ZI">● 五子棋游戏规则</td>
                  <td>&nbsp;</td>
                </tr>
              </table>
            </div></td>
        </tr>
        <tr> 
          <td background="images/yxgz_10.gif">
<div align="center">
              <table width="88%" border="0" cellpadding="0" cellspacing="0" class="ZI">
                <tr>
                  <td> <br>
                    目前五子棋有如下几种规则 <br>
                    一：无禁手规则:(本游戏中心的就是这种规则,适用于初学者)
                    <p>黑白双方依次落子，由黑先下，当棋盘上有三个子时(两黑一白),如果此时白方觉得开的局不利于自已可以提出交换,黑方无条件接受!也可以不交换,主动权在白方!然后继续下棋,任一方先在棋盘上形成横向、竖向、斜向的连续的相同颜色的五个(含五个以上)棋子的一方为胜。 
                    </p>
                    <p>二：禁手规则</p>
                    <p>禁手是针对黑棋而言的，禁手是指一手黑棋棋形成：双活三，双四，长连(五子以上)为输!这种方法限制了黑棋先行的优势！禁手对白棋无效！</p>
                    <p>三：RIF(国际连珠连盟)正式规则</p>
                    <p>1,第一位选手开局(指定的26种开局)</p>
                    <p>2,第二位选手默认执白，如果觉得第一位选手开局对黑有利可以交换(即三手交换)！并由执白者下第四手棋！</p>
                    <p>3,第五手黑棋要在棋盘上下两子（即五手两打）这两手不能对称（即两手棋的相对位置不能一样）,然后由白方从这两手中拿掉一个对白不利，对黑优势最大的那个子后下第六手棋！</p>
                    <p>4,开始轮留下子，黑棋有禁手!任何一方如果不想落子，可以放弃一手！</p>
                    <p>四：“Yamaguchi”规则</p>
                    <p>　　- 第一位选手摆出26种开局之一，并且提出要求本局需几个第5子。<br>
                      　　- 另一位选手有权交换。<br>
                      　　- 执白者在棋盘上任意位置放第4子。<br>
                      　　- 执黑者按前面提出的要求在棋盘上放若干个第5子。<br>
                      　　- 执白者从这些第5子中选择一个，然后落第6子。<br>
                      　　开局阶段结束后，按连珠规则正常继续进行。</p>
                    <p>五：“Tarannikov”规则<br>
                      　　- 执黑者在天元放第1子。<br>
                      　　- 另一位选手可以交换。<br>
                      　　- 执白者在中央3×3区域内放第2子。<br>
                      　　- 另一位选手可以交换。<br>
                      　　- 执黑者在中央5×5区域内放第3子。<br>
                      　　- 另一位选手可以交换。<br>
                      　　- 执白者在中央7×7区域内放第4子。<br>
                      　　- 另一位选手可以交换。<br>
                      　　- 执黑者在中央9×9区域内放第5子。<br>
                      　　- 另一位选手可以交换。<br>
                      　　- 执白者在棋盘上任意位置放第6子。<br>
                      　　开局阶段结束后，按连珠规则正常继续进行。</p>
                    <p>六：“Taraguchi”规则</p>
                    <p>　　- 执黑者在天元放第1子。<br>
                      　　- 另一位选手可以交换。<br>
                      　　- 执白者在中央3×3区域内放第2子。<br>
                      　　- 另一位选手可以交换。<br>
                      　　- 执黑者在中央5×5区域内放第3子。<br>
                      　　- 另一位选手可以交换。<br>
                      　　- 执白者在中央7×7区域内放第4子。<br>
                      　　选择1(4手之后)：<br>
                      　　- 另一位选手可以交换。<br>
                      　　- 执黑者在中央9×9区域内放第5子。<br>
                      　　- 另一位选手可以交换。<br>
                      　　- 执白者在棋盘上任意位置放第6子。<br>
                      　　选择2(4手之后)：<br>
                      　　- 执黑者在棋盘上任意位置放5个第5子。<br>
                      　　- 执白者选择这些5子之一，然后在棋盘上任意位置下第6子。<br>
                      　　开局阶段结束后，按连珠规则正常继续进行。</p>
                    <p>七：“Jonsson”规则</p>
                    <p>　　- 第一位选手摆出26种开局之一。<br>
                      　　- 另一位选手有权交换。<br>
                      　　- 执白者在棋盘上任意位置放第4子，然后声明需要1、2或3个第5子。<br>
                      　　- 另一位选手有权交换。<br>
                      　　- 执黑者按前面提出的要求在棋盘上放若干个第5子。<br>
                      　　- 执白者从这些第5子中选择一个，然后落第6子。<br>
                      　　开局阶段结束后，按连珠规则正常继续进行。</p>
                    <p>八：“Yamaguchi”规则的52种开局扩展变化</p>
                    <p>　　- 第一位选手摆出52种开局之一(在中央7×7区域内)，并声明需第5手的数量。<br>
                      　　- 另一位选手有权交换。<br>
                      　　- 执白者在棋盘上任意位置放第4子。<br>
                      　　- 执黑者按前面的声明在棋盘上放若干个第5子。<br>
                      　　- 执白者选择从这些5子中选择一个并下第6子。<br>
                      　　开局阶段结束后，按连珠规则正常继续进行。</p>
                    <p>九：“Yamaguchi”规则的变化</p>
                    <p>　　- 执黑者在天元放第1子。<br>
                      　　- 执白者在中央3×3区域内放第2子。<br>
                      　　- 执黑者在中央7×7区域内放第3子，并且提出要求本局需几个第5子。<br>
                      　　- 另一位选手有权交换。<br>
                      　　- 执白者在棋盘上任意位置放第4子。<br>
                      　　- 执黑者按前面提出的要求在棋盘上放若干个第5子。<br>
                      　　- 执白者从这些第5子中选择一个，然后下第6子。<br>
                      　　开局阶段结束后，按连珠规则正常继续进行。</p>
                    <p><br>
                      十：“Soosrv”规则</p>
                    <p>　　- 第一位选手摆出26种开局之一。<br>
                      　　- 另一位选手有权交换。<br>
                      　　- 另一位选手在棋盘上任意位置下第4子，并提出本盘棋需1、2、3或4个第5子。<br>
                      　　- 另一位选手有权交换。<br>
                      　　- 执黑者按前面提出的要求在棋盘上放若干个第5子。<br>
                      　　- 执白者从这些第5子中选择一个，然后下第6子。<br>
                      　　开局阶段结束后，按连珠规则正常继续进行。<br>
                    </p>
                    <br> </td>
                </tr>
              </table>
              
            </div></td>
        </tr>
        <tr>
          <td width="678">
<div align="center"><img src="images/yxgz_12.gif" width="678" height="35"></div></td>
        </tr>
      </table>
      
    <p>&nbsp;</p></td>
  </tr>
</table>
<!--#include file="../copy.asp" -->
</body>
</html>
